ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_STM/TARGET_STM32F4/serial_api.c
        int all_disabled = 0;

        if (irq == RxIrq) {
            __HAL_UART_DISABLE_IT(&UartHandle, UART_IT_RXNE);
            // Check if TxIrq is disabled too
            if ((UartHandle.Instance->CR1 & USART_CR1_TXEIE) == 0) all_disabled = 1;
        } else { // TxIrq
            __HAL_UART_DISABLE_IT(&UartHandle, UART_IT_TXE);
            // Check if RxIrq is disabled too
            if ((UartHandle.Instance->CR1 & USART_CR1_RXNEIE) == 0) all_disabled = 1;
        }

        if (all_disabled) {
          NVIC_DisableIRQ(irq_n);
#if DEVICE_SERIAL_ASYNCH_DMA
          NVIC_DisableIRQ(irqn_dma);
#endif
        }

    }
}

/******************************************************************************
 * READ/WRITE
 ******************************************************************************/

int serial_getc(serial_t *obj)
{
    USART_TypeDef *uart = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    while (!serial_readable(obj));
    return (int)(uart->DR & 0x1FF);
}

void serial_putc(serial_t *obj, int c)
{
    USART_TypeDef *uart = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    while (!serial_writable(obj));
    uart->DR = (uint32_t)(c & 0x1FF);
}

int serial_readable(serial_t *obj)
{
    int status;
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    // Check if data is received
    status = ((__HAL_UART_GET_FLAG(&UartHandle, UART_FLAG_RXNE) != RESET) ? 1 : 0);
    return status;
}

int serial_writable(serial_t *obj)
{
    int status;
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    // Check if data is transmitted
    status = ((__HAL_UART_GET_FLAG(&UartHandle, UART_FLAG_TXE) != RESET) ? 1 : 0);
    return status;
}

void serial_clear(serial_t *obj)
{
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    __HAL_UART_CLEAR_FLAG(&UartHandle, UART_FLAG_TXE);
    __HAL_UART_CLEAR_FLAG(&UartHandle, UART_FLAG_RXNE);
}

void serial_pinout_tx(PinName tx)
{
    pinmap_pinout(tx, PinMap_UART_TX);
}

void serial_break_set(serial_t *obj)
{
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    HAL_LIN_SendBreak(&UartHandle);
}

void serial_break_clear(serial_t *obj)
{
}

//########################################################################################

#if DEVICE_SERIAL_ASYNCH

//----------------------------------------------------------------------------------------
// LOCAL HELPER FUNCTIONS
//----------------------------------------------------------------------------------------

/** Configure the TX buffer for an asynchronous write serial transaction
 *
 * @param obj       The serial object.
 * @param tx        The buffer for sending.
 * @param tx_length The number of words to transmit.
 */
void h_serial_tx_buffer_set(serial_t *obj, void *tx, int tx_length, uint8_t width) {
    // We only support byte buffers for now
    MBED_ASSERT(width == 8);
    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);
  
    // Exit if a transmit is already on-going
    if (serial_tx_active(obj)) return;

    obj->tx_buff.buffer = tx;
    obj->tx_buff.length = tx_length;
    obj->tx_buff.pos = 0;

    return;
}

/** Configure the RX buffer for an asynchronous write serial transaction
 *
 * @param obj       The serial object.
 * @param tx        The buffer for sending.
 * @param tx_length The number of words to transmit.
 */
void h_serial_rx_buffer_set(serial_t *obj, void *rx, int rx_length, uint8_t width) {
    /* Sanity check arguments */
    MBED_ASSERT(obj);
    MBED_ASSERT(rx != (void*)0);
    // We only support byte buffers for now
    MBED_ASSERT(width == 8);

    // Exit if a reception is already on-going
    if (serial_rx_active(obj)) return;

    obj->rx_buff.buffer = rx;
    obj->rx_buff.length = rx_length;
    obj->rx_buff.pos = 0;

    return;
}

/** Configure TX events
 *
 * @param obj    The serial object
 * @param event  The logical OR of the TX events to configure
 * @param enable Set to non-zero to enable events, or zero to disable them
 */
void h_serial_tx_enable_event(serial_t *obj, int event, uint8_t enable) {
    // Shouldn't have to enable TX interrupt here, just need to keep track of the requested events.
    if (enable) _SERIAL_OBJ(events) |= event;
    else _SERIAL_OBJ(events) &= ~event;
}

/** Configure RX events
 *
 * @param obj    The serial object
 * @param event  The logical OR of the RX events to configure
 * @param enable Set to non-zero to enable events, or zero to disable them
 */
void h_serial_rx_enable_event(serial_t *obj, int event, uint8_t enable) {
    // Shouldn't have to enable RX interrupt here, just need to keep track of the requested events.
    if (enable) _SERIAL_OBJ(events) |= event;
    else _SERIAL_OBJ(events) &= ~event;
}

/**
* Get index of serial object TX IRQ, relating it to the physical peripheral.
*
* @param obj pointer to serial object
* @return internal NVIC TX IRQ index of U(S)ART peripheral
*/
IRQn_Type h_serial_get_irq_index(serial_t *obj) {
    IRQn_Type irq_n = (IRQn_Type)0;

    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);

    switch (_SERIAL_OBJ(uart)) {
#if defined(USART1_BASE)
        case UART_1:
            irq_n = USART1_IRQn;
            break;
#endif
#if defined(USART2_BASE)
        case UART_2:
            irq_n = USART2_IRQn;
            break;
#endif
#if defined(USART3_BASE)
        case UART_3:
            irq_n = USART3_IRQn;
            break;
#endif
#if defined(UART4_BASE)
        case UART_4:
            irq_n = UART4_IRQn;
            break;
#endif
#if defined(UART5_BASE)
        case UART_5:
            irq_n = UART5_IRQn;
            break;
#endif
#if defined(USART6_BASE)
        case UART_6:
            irq_n = USART6_IRQn;
            break;
#endif
#if defined(UART7_BASE)
        case UART_7:
            irq_n = UART7_IRQn;
            break;
#endif
#if defined(UART8_BASE)
        case UART_8:
            irq_n = UART8_IRQn;
            break;
#endif
        default:
            irq_n = (IRQn_Type)0;
    }
    
    return irq_n;
}

#if DEVICE_SERIAL_ASYNCH_DMA

/** The asynchronous TX and RX handler.
 *
 * @param obj The serial object
 * @return Returns event flags if a TX/RX transfer termination condition was met or 0 otherwise
 */
void h_serial_txdma_irq_handler_asynch() {
    HAL_DMA_IRQHandler(UartHandle.hdmatx);
}
/** The asynchronous TX and RX handler.
 *
 * @param obj The serial object
 * @return Returns event flags if a TX/RX transfer termination condition was met or 0 otherwise
 */
void h_serial_rxdma_irq_handler_asynch(serial_t *obj) {

//    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    HAL_DMA_IRQHandler(UartHandle.hdmarx);
}

/**
* Get index of serial object TX DMA IRQ, relating it to the physical peripheral.
*
* @param obj pointer to serial object
* @return internal NVIC TX DMA IRQ index of U(S)ART peripheral
*/
IRQn_Type h_serial_tx_get_irqdma_index(serial_t *obj) {
    IRQn_Type irq_n = (IRQn_Type)0;

    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);

    switch (_SERIAL_OBJ(uart)) {
#if 0
#if defined(USART1_BASE)
        case UART_1:
            irq_n = (IRQn_Type)0;
            break;
#endif
#endif
#if defined(USART2_BASE)
        case UART_2:
            irq_n = DMA1_Stream6_IRQn;
            break;
#endif
#if 0
#if defined(USART3_BASE)
        case UART_3:
            irq_n = (IRQn_Type)0;
            break;
#endif
#endif
#if defined(UART4_BASE)
        case UART_4:
            irq_n = DMA1_Stream4_IRQn;
            break;
#endif
#if 0
#if defined(UART5_BASE)
        case UART_5:
            irq_n = (IRQn_Type)0;
            break;
#endif
#if defined(USART6_BASE)
        case UART_6:
            irq_n = (IRQn_Type)0;
            break;
#endif
#if defined(UART7_BASE)
        case UART_7:
            irq_n = (IRQn_Type)0;
            break;
#endif
#if defined(UART8_BASE)
        case UART_8:
            irq_n = (IRQn_Type)0;
            break;
#endif
#endif
        default:
            irq_n = (IRQn_Type)0;
    }

    return irq_n;
}
/**
* Get index of serial object RX DMA IRQ, relating it to the physical peripheral.
*
* @param obj pointer to serial object
* @return internal NVIC RX DMA IRQ index of U(S)ART peripheral
*/
IRQn_Type h_serial_rx_get_irqdma_index(serial_t *obj) {
    IRQn_Type irq_n = (IRQn_Type)0;

    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);

    switch (_SERIAL_OBJ(uart)) {
#if 0
#if defined(USART1_BASE)
        case UART_1:
            irq_n = (IRQn_Type)0;
            break;
#endif
#endif
#if defined(USART2_BASE)
        case UART_2:
            irq_n = DMA1_Stream5_IRQn;
            break;
#endif
#if 0
#if defined(USART3_BASE)
        case UART_3:
            irq_n = (IRQn_Type)0;
            break;
#endif
#endif
#if defined(UART4_BASE)
        case UART_4:
            irq_n = DMA1_Stream2_IRQn;
            break;
#endif
#if 0
#if defined(UART5_BASE)
        case UART_5:
            irq_n = (IRQn_Type)0;
            break;
#endif
#if defined(USART6_BASE)
        case UART_6:
            irq_n = (IRQn_Type)0;
            break;
#endif
#if defined(UART7_BASE)
        case UART_7:
            irq_n = (IRQn_Type)0;
            break;
#endif
#if defined(UART8_BASE)
        case UART_8:
            irq_n = (IRQn_Type)0;
            break;
#endif
#endif
        default:
            irq_n = (IRQn_Type)0;
    }

    return irq_n;
}
static int h_serial_get_uart_index(UART_HandleTypeDef *huart){
    int index =0;

    switch((int)(huart->Instance)){
#if defined(USART1_BASE)
    case UART_1:
        index = 0;
        break;
#endif
#if defined(USART2_BASE)
    case UART_2:
        index = 1;
        break;
#endif
#if defined(USART3_BASE)
    case UART_3:
        index = 2;
        break;
#endif
#if defined(UART4_BASE)
    case UART_4:
        index = 3;
        break;
#endif
#if defined(UART5_BASE)
    case UART_5:
        index = 4;
        break;
#endif
#if defined(USART6_BASE)
    case UART_6:
        index = 5;
        break;
#endif
#if defined(UART7_BASE)
    case UART_7:
        index = 6;
        break;
#endif
#if defined(UART8_BASE)
    case UART_8:
        index = 7;
        break;
#endif
    default:
        index = -1;
  }
  return index;
}

#endif
//----------------------------------------------------------------------------------------
// MBED API FUNCTIONS
//----------------------------------------------------------------------------------------

/** Begin asynchronous TX transfer. The used buffer is specified in the serial object,
 *  tx_buff
 *
 * @param obj       The serial object
 * @param tx        The buffer for sending
 * @param tx_length The number of words to transmit
 * @param tx_width  The bit width of buffer word
 * @param handler   The serial handler
 * @param event     The logical OR of events to be registered
 * @param hint      A suggestion for how to use DMA with this transfer
 * @return Returns number of data transfered, or 0 otherwise
 */
int serial_tx_asynch(serial_t *obj, const void *tx, size_t tx_length, uint8_t tx_width, uint32_t handler, uint32_t event, DMAUsage hint) {
    
