ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_STM/TARGET_STM32F4/serial_api.c
    uint32_t tmpstatus = 0;
  
    // Check buffer is ok
    MBED_ASSERT(tx != (void*)0);
    MBED_ASSERT(tx_width == 8); // support only 8b width

    if (tx_length == 0) return 0;
  
    // Set up buffer
    h_serial_tx_buffer_set(obj, (void *)tx, tx_length, tx_width);
  
    // Set up events
    h_serial_tx_enable_event(obj, SERIAL_EVENT_TX_ALL, 0); // Clear all events
    h_serial_tx_enable_event(obj, event, 1); // Set only the wanted events
  
    // Enable interrupt
    IRQn_Type irqn = h_serial_get_irq_index(obj);
    NVIC_ClearPendingIRQ(irqn);
    NVIC_DisableIRQ(irqn);
    NVIC_SetPriority(irqn, 1);
    NVIC_SetVector(irqn, (uint32_t)handler);
    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);
    NVIC_EnableIRQ(irqn);
#if DEVICE_SERIAL_ASYNCH_DMA
    // Enable DMA interrupt
    irqn = h_serial_tx_get_irqdma_index(obj);
    NVIC_ClearPendingIRQ(irqn);
    NVIC_DisableIRQ(irqn);
    NVIC_SetPriority(irqn, 1);
    NVIC_SetVector(irqn, (uint32_t)&h_serial_txdma_irq_handler_asynch);
    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);
    NVIC_EnableIRQ(irqn);

    // the following function will enable program and enable the DMA transfer
    if (HAL_UART_Transmit_DMA(&UartHandle, (uint8_t*)tx, tx_length) != HAL_OK)
    {
      /* Transfer error in transmission process */
      return 0;
    }
#else
    // the following function will enable UART_IT_TXE and error interrupts
    if (HAL_UART_Transmit_IT(&UartHandle, (uint8_t*)tx, tx_length) != HAL_OK)
    {
      /* Transfer error in transmission process */
      return 0;
    }
#endif
    while ((tmpstatus == HAL_UART_STATE_BUSY_TX) || (tmpstatus == HAL_UART_STATE_BUSY_TX_RX)){
      tmpstatus = HAL_UART_GetState(&UartHandle);
    }
  
    return tx_length;
}

/** Begin asynchronous RX transfer (enable interrupt for data collecting)
 *  The used buffer is specified in the serial object - rx_buff
 *
 * @param obj        The serial object
 * @param rx         The buffer for sending
 * @param rx_length  The number of words to transmit
 * @param rx_width   The bit width of buffer word
 * @param handler    The serial handler
 * @param event      The logical OR of events to be registered
 * @param handler    The serial handler
 * @param char_match A character in range 0-254 to be matched
 * @param hint       A suggestion for how to use DMA with this transfer
 */
void serial_rx_asynch(serial_t *obj, void *rx, size_t rx_length, uint8_t rx_width, uint32_t handler, uint32_t event, uint8_t char_match, DMAUsage hint, void (*callback)(int), int event2)
{
    /* Sanity check arguments */
    MBED_ASSERT(obj);
    MBED_ASSERT(rx != (void*)0);
    MBED_ASSERT(rx_width == 8); // support only 8b width

    h_serial_rx_enable_event(obj, SERIAL_EVENT_RX_ALL, 0);
    h_serial_rx_enable_event(obj, event, 1);
    // set CharMatch
    if (char_match != SERIAL_RESERVED_CHAR_MATCH) {
        obj->char_match = char_match;
    }
    h_serial_rx_buffer_set(obj, rx, rx_length, rx_width);

    IRQn_Type irqn = h_serial_get_irq_index(obj);
    NVIC_ClearPendingIRQ(irqn);
    NVIC_DisableIRQ(irqn);
    NVIC_SetPriority(irqn, 0);
    NVIC_SetVector(irqn, (uint32_t)handler);
    NVIC_EnableIRQ(irqn);

    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);
#if DEVICE_SERIAL_ASYNCH_DMA
    // Enable DMA interrupt
    irqn = h_serial_rx_get_irqdma_index(obj);
    NVIC_ClearPendingIRQ(irqn);
    NVIC_DisableIRQ(irqn);
    NVIC_SetPriority(irqn, 1);
    NVIC_SetVector(irqn, (uint32_t)&h_serial_rxdma_irq_handler_asynch);
    UartHandle.Instance = (USART_TypeDef *)_SERIAL_OBJ(uart);
    NVIC_EnableIRQ(irqn);

    if (_SERIAL_OBJ(index) != -1){
        Tab_RxCallbacks[_SERIAL_OBJ(index)] = (CB_Add_t)callback;
        Tab_RxCallbackEvents[_SERIAL_OBJ(index)] = event2;
    }

    // following HAL function will program and enable the DMA transfer
    HAL_UART_Receive_DMA(&UartHandle, (uint8_t*)rx, rx_length);
#else
    // following HAL function will enable the RXNE interrupt + error interrupts    
    HAL_UART_Receive_IT(&UartHandle, (uint8_t*)rx, rx_length);
#endif
    
    return;
}

/** Attempts to determine if the serial peripheral is already in use for TX
 *
 * @param obj The serial object
 * @return Non-zero if the TX transaction is ongoing, 0 otherwise
 */
uint8_t serial_tx_active(serial_t *obj)
{
    MBED_ASSERT(obj);
    MBED_ASSERT(HAL_UART_STATE_BUSY_TX==0x12);
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    return ((HAL_UART_GetState(&UartHandle) & UART_STATE_TX_ACTIVE) ? 1 : 0);
}

/** Attempts to determine if the serial peripheral is already in use for RX
 *
 * @param obj The serial object
 * @return Non-zero if the RX transaction is ongoing, 0 otherwise
 */
uint8_t serial_rx_active(serial_t *obj)
{
    MBED_ASSERT(obj);
    MBED_ASSERT(HAL_UART_STATE_BUSY_RX==0x22);
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    return ((HAL_UART_GetState(&UartHandle) & UART_STATE_RX_ACTIVE) ? 1 : 0);

}

#if DEVICE_SERIAL_ASYNCH_DMA
/* the following function is weak in the HAL code */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){
    CB_Add_t callback_address;
    int index = 0; int event = 0;
    uint8_t *buf = (uint8_t*)SerialRxObj->rx_buff.buffer;
    //RX PART
    // increment rx_buff.pos
    if (UartHandle.RxXferSize !=0) { 
        SerialRxObj->rx_buff.pos = UartHandle.RxXferSize - UartHandle.RxXferCount;
    }

    if ((buf != NULL) && (buf[SerialRxObj->rx_buff.pos-1] == SerialRxObj->char_match)) {
      EventStatus |= SERIAL_EVENT_RX_CHARACTER_MATCH;
    }

   EventStatus |= SERIAL_EVENT_RX_COMPLETE;
   index = h_serial_get_uart_index(huart);
  
   callback_address = (void (*)(int)) *(__IO uint32_t*) (Tab_RxCallbacks[index]);
   event = Tab_RxCallbackEvents[index];
   if (callback_address !=0) {
        callback_address(EventStatus&event);
   }
   EventStatus &= SERIAL_EVENT_RX_COMPLETE;
   EventStatus &= SERIAL_EVENT_RX_CHARACTER_MATCH;
}
#endif

/** The asynchronous TX and RX handler.
 *
 * @param obj The serial object
 * @return Returns event flags if a TX/RX transfer termination condition was met or 0 otherwise
 */
int serial_irq_handler_asynch(serial_t *obj)
{
  volatile int return_event = 0;
#if !DEVICE_SERIAL_ASYNCH_DMA
  uint8_t *buf = (uint8_t*)obj->rx_buff.buffer;
#endif
  // Irq handler is common to Tx and Rx
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    HAL_UART_IRQHandler(&UartHandle);
  // TX PART:
    if (__HAL_UART_GET_FLAG(&UartHandle, UART_FLAG_TC) != RESET) {
        __HAL_UART_CLEAR_FLAG(&UartHandle, UART_FLAG_TC);
        // return event SERIAL_EVENT_TX_COMPLETE if requested
        if ((_SERIAL_OBJ(events) & SERIAL_EVENT_TX_COMPLETE ) != 0){
            return_event |= SERIAL_EVENT_TX_COMPLETE & obj->serial.events;
        }
    }
    // handle error events:
    if (__HAL_UART_GET_FLAG(&UartHandle, HAL_UART_ERROR_PE)) {
        __HAL_UART_CLEAR_FLAG(&UartHandle, HAL_UART_ERROR_PE);
        return_event |= SERIAL_EVENT_RX_PARITY_ERROR & obj->serial.events;
    }
    if (__HAL_UART_GET_FLAG(&UartHandle, HAL_UART_ERROR_NE)) {
      __HAL_UART_CLEAR_FLAG(&UartHandle, HAL_UART_ERROR_NE);
      // not supported by mbed
    }
    if (__HAL_UART_GET_FLAG(&UartHandle, HAL_UART_ERROR_FE)) {
      __HAL_UART_CLEAR_FLAG(&UartHandle, HAL_UART_ERROR_FE);
        return_event |= SERIAL_EVENT_RX_FRAMING_ERROR & obj->serial.events;
    }
    if (__HAL_UART_GET_FLAG(&UartHandle, HAL_UART_ERROR_ORE)) {
      __HAL_UART_CLEAR_FLAG(&UartHandle, HAL_UART_ERROR_ORE);
        return_event |= SERIAL_EVENT_RX_OVERRUN_ERROR & obj->serial.events;
    }
 
#if DEVICE_SERIAL_ASYNCH_DMA
      if ((EventStatus&SERIAL_EVENT_RX_COMPLETE) !=0) {
        return_event |= SERIAL_EVENT_RX_COMPLETE & obj->serial.events;
        EventStatus &= ~SERIAL_EVENT_RX_COMPLETE;
    }
#else
    //RX PART
    // increment rx_buff.pos
    if (UartHandle.RxXferSize !=0) { 
        obj->rx_buff.pos = UartHandle.RxXferSize - UartHandle.RxXferCount;
    }
    if ((UartHandle.RxXferCount==0)&&(UartHandle.RxXferSize !=0)) {
        return_event |= SERIAL_EVENT_RX_COMPLETE & obj->serial.events;
    
    if ((buf != NULL) && (buf[obj->rx_buff.pos-1] == obj->char_match) && (_SERIAL_OBJ(events) & SERIAL_EVENT_RX_CHARACTER_MATCH)) {
      return_event |= SERIAL_EVENT_RX_CHARACTER_MATCH & obj->serial.events;
    }
#endif
    return return_event;  
}

/** Abort the ongoing TX transaction. It disables the enabled interupt for TX and
 *  flush TX hardware buffer if TX FIFO is used
 *
 * @param obj The serial object
 */
void serial_tx_abort_asynch(serial_t *obj) {
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    __HAL_UART_DISABLE_IT(&UartHandle, UART_IT_TC|UART_IT_TXE);
    UartHandle.Instance = 0;

    obj->tx_buff.buffer = 0;
    obj->tx_buff.length = 0;
  
}

/** Abort the ongoing RX transaction It disables the enabled interrupt for RX and
 *  flush RX hardware buffer if RX FIFO is used
 *
 * @param obj The serial object
 */
void serial_rx_abort_asynch(serial_t *obj) {

    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    __HAL_UART_DISABLE_IT(&UartHandle, UART_IT_RXNE);
    UartHandle.Instance = 0;
  
    obj->rx_buff.buffer = 0;
    obj->rx_buff.length = 0;

}

#endif

#endif
